[
  {
    "id": "art-52",
    "number": "52",
    "title": "Article 52 Provision",
    "simplifiedText": "Article 52 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 52 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 52 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_1771046495428.png"
  },
  {
    "id": "art-53",
    "number": "53",
    "title": "Article 53 Provision",
    "simplifiedText": "Article 53 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 53 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 53 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/parliament_india_1771044134109.png"
  },
  {
    "id": "art-54",
    "number": "54",
    "title": "Article 54 Provision",
    "simplifiedText": "Article 54 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 54 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 54 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/supreme_court_india_1771044151085.png"
  },
  {
    "id": "art-55",
    "number": "55",
    "title": "Article 55 Provision",
    "simplifiedText": "Article 55 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 55 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 55 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_1771046464103.png"
  },
  {
    "id": "art-56",
    "number": "56",
    "title": "Article 56 Provision",
    "simplifiedText": "Article 56 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 56 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 56 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/supreme_court_india_1771044151085.png"
  },
  {
    "id": "art-57",
    "number": "57",
    "title": "Article 57 Provision",
    "simplifiedText": "Article 57 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 57 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 57 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_illustration.png"
  },
  {
    "id": "art-58",
    "number": "58",
    "title": "Article 58 Provision",
    "simplifiedText": "Article 58 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 58 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 58 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_illustration_1771044551592.png"
  },
  {
    "id": "art-59",
    "number": "59",
    "title": "Article 59 Provision",
    "simplifiedText": "Article 59 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 59 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 59 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/high_court_illustration_1771044440164.png"
  },
  {
    "id": "art-60",
    "number": "60",
    "title": "Article 60 Provision",
    "simplifiedText": "Article 60 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 60 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 60 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_art_1771049294810.png"
  },
  {
    "id": "art-61",
    "number": "61",
    "title": "Article 61 Provision",
    "simplifiedText": "Article 61 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 61 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 61 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/supreme_court_india_1771044151085.png"
  },
  {
    "id": "art-62",
    "number": "62",
    "title": "Article 62 Provision",
    "simplifiedText": "Article 62 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 62 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 62 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/indian_parliament_illustration_1771044387970.png"
  },
  {
    "id": "art-63",
    "number": "63",
    "title": "Article 63 Provision",
    "simplifiedText": "Article 63 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 63 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 63 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_illustration.png"
  },
  {
    "id": "art-64",
    "number": "64",
    "title": "Article 64 Provision",
    "simplifiedText": "Article 64 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 64 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 64 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/preamble_illustration.png"
  },
  {
    "id": "art-65",
    "number": "65",
    "title": "Article 65 Provision",
    "simplifiedText": "Article 65 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 65 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 65 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/equality_illustration_1771044348189.png"
  },
  {
    "id": "art-66",
    "number": "66",
    "title": "Article 66 Provision",
    "simplifiedText": "Article 66 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 66 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 66 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/parliament_illustration_1771044236750.png"
  },
  {
    "id": "art-67",
    "number": "67",
    "title": "Article 67 Provision",
    "simplifiedText": "Article 67 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 67 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 67 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/fundamental_rights_illustration.png"
  },
  {
    "id": "art-68",
    "number": "68",
    "title": "Article 68 Provision",
    "simplifiedText": "Article 68 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 68 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 68 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_india_1771045228434.png"
  },
  {
    "id": "art-69",
    "number": "69",
    "title": "Article 69 Provision",
    "simplifiedText": "Article 69 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 69 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 69 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_illustration.png"
  },
  {
    "id": "art-70",
    "number": "70",
    "title": "Article 70 Provision",
    "simplifiedText": "Article 70 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 70 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 70 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/fundamental_rights_illustration_1771044270654.png"
  },
  {
    "id": "art-71",
    "number": "71",
    "title": "Article 71 Provision",
    "simplifiedText": "Article 71 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 71 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 71 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/preamble_illustration_1771045972132.png"
  },
  {
    "id": "art-72",
    "number": "72",
    "title": "Article 72 Provision",
    "simplifiedText": "Article 72 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 72 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 72 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/president_illustration_1771044221817.png"
  },
  {
    "id": "art-73",
    "number": "73",
    "title": "Article 73 Provision",
    "simplifiedText": "Article 73 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 73 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 73 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_illustration.png"
  },
  {
    "id": "art-74",
    "number": "74",
    "title": "Article 74 Provision",
    "simplifiedText": "Article 74 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 74 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 74 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_illustration_1771044551592.png"
  },
  {
    "id": "art-75",
    "number": "75",
    "title": "Article 75 Provision",
    "simplifiedText": "Article 75 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 75 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 75 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_pillar_1771045189047.png"
  },
  {
    "id": "art-76",
    "number": "76",
    "title": "Article 76 Provision",
    "simplifiedText": "Article 76 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 76 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 76 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_hero_1771044828478.png"
  },
  {
    "id": "art-77",
    "number": "77",
    "title": "Article 77 Provision",
    "simplifiedText": "Article 77 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 77 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 77 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_illustration.png"
  },
  {
    "id": "art-78",
    "number": "78",
    "title": "Article 78 Provision",
    "simplifiedText": "Article 78 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Executive branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the union level, Article 78 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Executive",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 78 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/fundamental_rights_illustration.png"
  },
  {
    "id": "art-79",
    "number": "79",
    "title": "Article 79 Provision",
    "simplifiedText": "Article 79 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 79 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 79 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/president_india_1771044119549.png"
  },
  {
    "id": "art-80",
    "number": "80",
    "title": "Article 80 Provision",
    "simplifiedText": "Article 80 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 80 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 80 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/supreme_court_illustration_1771044251244.png"
  },
  {
    "id": "art-81",
    "number": "81",
    "title": "Article 81 Provision",
    "simplifiedText": "Article 81 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 81 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 81 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/fundamental_rights_illustration_1771044270654.png"
  },
  {
    "id": "art-82",
    "number": "82",
    "title": "Article 82 Provision",
    "simplifiedText": "Article 82 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 82 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 82 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_1771046495428.png"
  },
  {
    "id": "art-83",
    "number": "83",
    "title": "Article 83 Provision",
    "simplifiedText": "Article 83 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 83 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 83 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/fundamental_rights_icon_1771045207570.png"
  },
  {
    "id": "art-84",
    "number": "84",
    "title": "Article 84 Provision",
    "simplifiedText": "Article 84 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 84 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 84 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_hero_1771044865419.png"
  },
  {
    "id": "art-85",
    "number": "85",
    "title": "Article 85 Provision",
    "simplifiedText": "Article 85 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 85 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 85 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/parliament_illustration_1771044236750.png"
  },
  {
    "id": "art-86",
    "number": "86",
    "title": "Article 86 Provision",
    "simplifiedText": "Article 86 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 86 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 86 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/parliament_illustration_1771044236750.png"
  },
  {
    "id": "art-87",
    "number": "87",
    "title": "Article 87 Provision",
    "simplifiedText": "Article 87 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 87 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 87 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_hero_1771044828478.png"
  },
  {
    "id": "art-88",
    "number": "88",
    "title": "Article 88 Provision",
    "simplifiedText": "Article 88 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 88 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 88 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/fundamental_rights_illustration_1771044270654.png"
  },
  {
    "id": "art-89",
    "number": "89",
    "title": "Article 89 Provision",
    "simplifiedText": "Article 89 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 89 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 89 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/high_court_illustration_1771044440164.png"
  },
  {
    "id": "art-90",
    "number": "90",
    "title": "Article 90 Provision",
    "simplifiedText": "Article 90 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 90 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 90 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/high_court_illustration_1771044440164.png"
  },
  {
    "id": "art-91",
    "number": "91",
    "title": "Article 91 Provision",
    "simplifiedText": "Article 91 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 91 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 91 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/preamble_illustration_1771045972132.png"
  },
  {
    "id": "art-92",
    "number": "92",
    "title": "Article 92 Provision",
    "simplifiedText": "Article 92 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 92 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 92 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/supreme_court_india_1771044151085.png"
  },
  {
    "id": "art-93",
    "number": "93",
    "title": "Article 93 Provision",
    "simplifiedText": "Article 93 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 93 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 93 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/law_and_justice_india_1771044199869.png"
  },
  {
    "id": "art-94",
    "number": "94",
    "title": "Article 94 Provision",
    "simplifiedText": "Article 94 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 94 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 94 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_pillar_1771045189047.png"
  },
  {
    "id": "art-95",
    "number": "95",
    "title": "Article 95 Provision",
    "simplifiedText": "Article 95 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 95 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 95 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_hero_1771044865419.png"
  },
  {
    "id": "art-96",
    "number": "96",
    "title": "Article 96 Provision",
    "simplifiedText": "Article 96 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 96 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 96 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/president_illustration_1771044221817.png"
  },
  {
    "id": "art-97",
    "number": "97",
    "title": "Article 97 Provision",
    "simplifiedText": "Article 97 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 97 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 97 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_1771046495428.png"
  },
  {
    "id": "art-98",
    "number": "98",
    "title": "Article 98 Provision",
    "simplifiedText": "Article 98 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 98 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 98 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/parliament_india_1771044134109.png"
  },
  {
    "id": "art-99",
    "number": "99",
    "title": "Article 99 Provision",
    "simplifiedText": "Article 99 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 99 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 99 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/fundamental_rights_illustration.png"
  },
  {
    "id": "art-100",
    "number": "100",
    "title": "Article 100 Provision",
    "simplifiedText": "Article 100 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 100 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 100 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/president_illustration_1771044221817.png"
  },
  {
    "id": "art-101",
    "number": "101",
    "title": "Article 101 Provision",
    "simplifiedText": "Article 101 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 101 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 101 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/high_court_illustration_1771044440164.png"
  },
  {
    "id": "art-102",
    "number": "102",
    "title": "Article 102 Provision",
    "simplifiedText": "Article 102 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 102 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 102 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_1771046495428.png"
  },
  {
    "id": "art-103",
    "number": "103",
    "title": "Article 103 Provision",
    "simplifiedText": "Article 103 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 103 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 103 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/president_illustration_1771044221817.png"
  },
  {
    "id": "art-104",
    "number": "104",
    "title": "Article 104 Provision",
    "simplifiedText": "Article 104 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 104 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 104 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/fundamental_rights_icon_1771045207570.png"
  },
  {
    "id": "art-105",
    "number": "105",
    "title": "Article 105 Provision",
    "simplifiedText": "Article 105 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 105 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 105 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/high_court_illustration_1771044440164.png"
  },
  {
    "id": "art-106",
    "number": "106",
    "title": "Article 106 Provision",
    "simplifiedText": "Article 106 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 106 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 106 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/parliament_illustration_1771044236750.png"
  },
  {
    "id": "art-107",
    "number": "107",
    "title": "Article 107 Provision",
    "simplifiedText": "Article 107 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 107 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 107 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_india_1771045228434.png"
  },
  {
    "id": "art-108",
    "number": "108",
    "title": "Article 108 Provision",
    "simplifiedText": "Article 108 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 108 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 108 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_hero_1771044828478.png"
  },
  {
    "id": "art-109",
    "number": "109",
    "title": "Article 109 Provision",
    "simplifiedText": "Article 109 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 109 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 109 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_1771046464103.png"
  },
  {
    "id": "art-110",
    "number": "110",
    "title": "Article 110 Provision",
    "simplifiedText": "Article 110 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 110 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 110 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_india_1771045259455.png"
  },
  {
    "id": "art-111",
    "number": "111",
    "title": "Article 111 Provision",
    "simplifiedText": "Article 111 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 111 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 111 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_pillar_1771045173548.png"
  },
  {
    "id": "art-112",
    "number": "112",
    "title": "Article 112 Provision",
    "simplifiedText": "Article 112 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 112 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 112 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/fundamental_rights_illustration_1771044270654.png"
  },
  {
    "id": "art-113",
    "number": "113",
    "title": "Article 113 Provision",
    "simplifiedText": "Article 113 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 113 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 113 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_1771046495428.png"
  },
  {
    "id": "art-114",
    "number": "114",
    "title": "Article 114 Provision",
    "simplifiedText": "Article 114 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 114 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 114 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_1771046464103.png"
  },
  {
    "id": "art-115",
    "number": "115",
    "title": "Article 115 Provision",
    "simplifiedText": "Article 115 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 115 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 115 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_hero_1771044865419.png"
  },
  {
    "id": "art-116",
    "number": "116",
    "title": "Article 116 Provision",
    "simplifiedText": "Article 116 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 116 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 116 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/supreme_court_illustration_1771044251244.png"
  },
  {
    "id": "art-117",
    "number": "117",
    "title": "Article 117 Provision",
    "simplifiedText": "Article 117 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 117 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 117 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_illustration_1771044551592.png"
  },
  {
    "id": "art-118",
    "number": "118",
    "title": "Article 118 Provision",
    "simplifiedText": "Article 118 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 118 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 118 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/fundamental_rights_icon_1771045207570.png"
  },
  {
    "id": "art-119",
    "number": "119",
    "title": "Article 119 Provision",
    "simplifiedText": "Article 119 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 119 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 119 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_india_1771045228434.png"
  },
  {
    "id": "art-120",
    "number": "120",
    "title": "Article 120 Provision",
    "simplifiedText": "Article 120 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 120 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 120 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/governor_india_1771044165721.png"
  },
  {
    "id": "art-121",
    "number": "121",
    "title": "Article 121 Provision",
    "simplifiedText": "Article 121 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 121 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 121 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_pillar_1771045189047.png"
  },
  {
    "id": "art-122",
    "number": "122",
    "title": "Article 122 Provision",
    "simplifiedText": "Article 122 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Legislature branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the union level, Article 122 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Legislature",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 122 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_1771046495428.png"
  },
  {
    "id": "art-124",
    "number": "124",
    "title": "Article 124 Provision",
    "simplifiedText": "Article 124 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 124 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 124 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_branch_hero_1771044850068.png"
  },
  {
    "id": "art-125",
    "number": "125",
    "title": "Article 125 Provision",
    "simplifiedText": "Article 125 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 125 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 125 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_1771046495428.png"
  },
  {
    "id": "art-126",
    "number": "126",
    "title": "Article 126 Provision",
    "simplifiedText": "Article 126 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 126 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 126 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/supreme_court_india_1771044151085.png"
  },
  {
    "id": "art-127",
    "number": "127",
    "title": "Article 127 Provision",
    "simplifiedText": "Article 127 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 127 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 127 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_india_1771045259455.png"
  },
  {
    "id": "art-128",
    "number": "128",
    "title": "Article 128 Provision",
    "simplifiedText": "Article 128 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 128 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 128 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_1771046464103.png"
  },
  {
    "id": "art-129",
    "number": "129",
    "title": "Article 129 Provision",
    "simplifiedText": "Article 129 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 129 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 129 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_india_1771045228434.png"
  },
  {
    "id": "art-130",
    "number": "130",
    "title": "Article 130 Provision",
    "simplifiedText": "Article 130 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 130 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 130 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_illustration.png"
  },
  {
    "id": "art-131",
    "number": "131",
    "title": "Article 131 Provision",
    "simplifiedText": "Article 131 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 131 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 131 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_pillar_1771045189047.png"
  },
  {
    "id": "art-132",
    "number": "132",
    "title": "Article 132 Provision",
    "simplifiedText": "Article 132 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 132 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 132 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/supreme_court_india_1771044151085.png"
  },
  {
    "id": "art-133",
    "number": "133",
    "title": "Article 133 Provision",
    "simplifiedText": "Article 133 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 133 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 133 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/supreme_court_india_1771044151085.png"
  },
  {
    "id": "art-134",
    "number": "134",
    "title": "Article 134 Provision",
    "simplifiedText": "Article 134 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 134 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 134 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_pillar_1771045173548.png"
  },
  {
    "id": "art-135",
    "number": "135",
    "title": "Article 135 Provision",
    "simplifiedText": "Article 135 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 135 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 135 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_1771046495428.png"
  },
  {
    "id": "art-136",
    "number": "136",
    "title": "Article 136 Provision",
    "simplifiedText": "Article 136 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 136 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 136 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/equality_illustration_1771044348189.png"
  },
  {
    "id": "art-137",
    "number": "137",
    "title": "Article 137 Provision",
    "simplifiedText": "Article 137 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 137 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 137 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_india_1771045259455.png"
  },
  {
    "id": "art-138",
    "number": "138",
    "title": "Article 138 Provision",
    "simplifiedText": "Article 138 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 138 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 138 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/parliament_illustration_1771044236750.png"
  },
  {
    "id": "art-139",
    "number": "139",
    "title": "Article 139 Provision",
    "simplifiedText": "Article 139 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 139 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 139 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/governor_india_1771044165721.png"
  },
  {
    "id": "art-140",
    "number": "140",
    "title": "Article 140 Provision",
    "simplifiedText": "Article 140 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 140 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 140 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/president_india_1771044119549.png"
  },
  {
    "id": "art-141",
    "number": "141",
    "title": "Article 141 Provision",
    "simplifiedText": "Article 141 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 141 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 141 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/supreme_court_india_1771044151085.png"
  },
  {
    "id": "art-142",
    "number": "142",
    "title": "Article 142 Provision",
    "simplifiedText": "Article 142 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 142 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 142 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_illustration.png"
  },
  {
    "id": "art-143",
    "number": "143",
    "title": "Article 143 Provision",
    "simplifiedText": "Article 143 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 143 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 143 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/preamble_illustration_1771045972132.png"
  },
  {
    "id": "art-144",
    "number": "144",
    "title": "Article 144 Provision",
    "simplifiedText": "Article 144 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 144 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 144 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_branch_1771046479097.png"
  },
  {
    "id": "art-145",
    "number": "145",
    "title": "Article 145 Provision",
    "simplifiedText": "Article 145 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 145 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 145 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_pillar_1771045173548.png"
  },
  {
    "id": "art-146",
    "number": "146",
    "title": "Article 146 Provision",
    "simplifiedText": "Article 146 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 146 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 146 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/fundamental_rights_illustration_1771044270654.png"
  },
  {
    "id": "art-147",
    "number": "147",
    "title": "Article 147 Provision",
    "simplifiedText": "Article 147 is an important constitutional provision under Part V of the Indian Constitution. It deals with matters related to the Judiciary branch at the Union level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the union level, Article 147 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "V",
    "category": "Judiciary",
    "organ": "Union",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 147 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/president_illustration_1771044221817.png"
  },
  {
    "id": "art-153",
    "number": "153",
    "title": "Article 153 Provision",
    "simplifiedText": "Article 153 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Executive branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the state level, Article 153 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Executive",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 153 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/president_illustration_1771044221817.png"
  },
  {
    "id": "art-154",
    "number": "154",
    "title": "Article 154 Provision",
    "simplifiedText": "Article 154 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Executive branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the state level, Article 154 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Executive",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 154 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/fundamental_rights_illustration.png"
  },
  {
    "id": "art-155",
    "number": "155",
    "title": "Article 155 Provision",
    "simplifiedText": "Article 155 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Executive branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the state level, Article 155 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Executive",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 155 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/equality_illustration_1771044348189.png"
  },
  {
    "id": "art-156",
    "number": "156",
    "title": "Article 156 Provision",
    "simplifiedText": "Article 156 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Executive branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the state level, Article 156 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Executive",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 156 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_illustration.png"
  },
  {
    "id": "art-157",
    "number": "157",
    "title": "Article 157 Provision",
    "simplifiedText": "Article 157 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Executive branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the state level, Article 157 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Executive",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 157 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_illustration.png"
  },
  {
    "id": "art-158",
    "number": "158",
    "title": "Article 158 Provision",
    "simplifiedText": "Article 158 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Executive branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the state level, Article 158 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Executive",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 158 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_1771046495428.png"
  },
  {
    "id": "art-159",
    "number": "159",
    "title": "Article 159 Provision",
    "simplifiedText": "Article 159 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Executive branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the state level, Article 159 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Executive",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 159 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_hero_1771044865419.png"
  },
  {
    "id": "art-160",
    "number": "160",
    "title": "Article 160 Provision",
    "simplifiedText": "Article 160 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Executive branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the state level, Article 160 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Executive",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 160 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_1771046464103.png"
  },
  {
    "id": "art-161",
    "number": "161",
    "title": "Article 161 Provision",
    "simplifiedText": "Article 161 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Executive branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the state level, Article 161 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Executive",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 161 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/equality_illustration_1771044348189.png"
  },
  {
    "id": "art-162",
    "number": "162",
    "title": "Article 162 Provision",
    "simplifiedText": "Article 162 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Executive branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the state level, Article 162 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Executive",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 162 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_pillar_1771045173548.png"
  },
  {
    "id": "art-163",
    "number": "163",
    "title": "Article 163 Provision",
    "simplifiedText": "Article 163 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Executive branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the state level, Article 163 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Executive",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 163 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/president_india_1771044119549.png"
  },
  {
    "id": "art-164",
    "number": "164",
    "title": "Article 164 Provision",
    "simplifiedText": "Article 164 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Executive branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the state level, Article 164 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Executive",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 164 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_pillar_1771045173548.png"
  },
  {
    "id": "art-165",
    "number": "165",
    "title": "Article 165 Provision",
    "simplifiedText": "Article 165 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Executive branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the state level, Article 165 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Executive",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 165 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/fundamental_rights_illustration.png"
  },
  {
    "id": "art-166",
    "number": "166",
    "title": "Article 166 Provision",
    "simplifiedText": "Article 166 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Executive branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the state level, Article 166 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Executive",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 166 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/president_illustration_1771044221817.png"
  },
  {
    "id": "art-167",
    "number": "167",
    "title": "Article 167 Provision",
    "simplifiedText": "Article 167 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Executive branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the executive so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the executive branch at the state level, Article 167 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Executive",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 167 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/parliament_illustration_1771044236750.png"
  },
  {
    "id": "art-168",
    "number": "168",
    "title": "Article 168 Provision",
    "simplifiedText": "Article 168 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 168 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 168 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_illustration_1771044568240.png"
  },
  {
    "id": "art-169",
    "number": "169",
    "title": "Article 169 Provision",
    "simplifiedText": "Article 169 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 169 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 169 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/law_and_justice_india_1771044199869.png"
  },
  {
    "id": "art-170",
    "number": "170",
    "title": "Article 170 Provision",
    "simplifiedText": "Article 170 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 170 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 170 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_hero_1771044828478.png"
  },
  {
    "id": "art-171",
    "number": "171",
    "title": "Article 171 Provision",
    "simplifiedText": "Article 171 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 171 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 171 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_illustration.png"
  },
  {
    "id": "art-172",
    "number": "172",
    "title": "Article 172 Provision",
    "simplifiedText": "Article 172 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 172 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 172 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_art_1771049294810.png"
  },
  {
    "id": "art-173",
    "number": "173",
    "title": "Article 173 Provision",
    "simplifiedText": "Article 173 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 173 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 173 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_1771046495428.png"
  },
  {
    "id": "art-174",
    "number": "174",
    "title": "Article 174 Provision",
    "simplifiedText": "Article 174 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 174 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 174 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_branch_india_1771045244888.png"
  },
  {
    "id": "art-175",
    "number": "175",
    "title": "Article 175 Provision",
    "simplifiedText": "Article 175 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 175 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 175 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_illustration.png"
  },
  {
    "id": "art-176",
    "number": "176",
    "title": "Article 176 Provision",
    "simplifiedText": "Article 176 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 176 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 176 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_pillar_1771045173548.png"
  },
  {
    "id": "art-177",
    "number": "177",
    "title": "Article 177 Provision",
    "simplifiedText": "Article 177 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 177 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 177 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/preamble_illustration.png"
  },
  {
    "id": "art-178",
    "number": "178",
    "title": "Article 178 Provision",
    "simplifiedText": "Article 178 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 178 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 178 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_1771046495428.png"
  },
  {
    "id": "art-179",
    "number": "179",
    "title": "Article 179 Provision",
    "simplifiedText": "Article 179 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 179 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 179 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_1771046464103.png"
  },
  {
    "id": "art-180",
    "number": "180",
    "title": "Article 180 Provision",
    "simplifiedText": "Article 180 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 180 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 180 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_india_1771045259455.png"
  },
  {
    "id": "art-181",
    "number": "181",
    "title": "Article 181 Provision",
    "simplifiedText": "Article 181 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 181 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 181 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_1771046495428.png"
  },
  {
    "id": "art-182",
    "number": "182",
    "title": "Article 182 Provision",
    "simplifiedText": "Article 182 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 182 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 182 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_india_1771045259455.png"
  },
  {
    "id": "art-183",
    "number": "183",
    "title": "Article 183 Provision",
    "simplifiedText": "Article 183 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 183 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 183 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/supreme_court_india_1771044151085.png"
  },
  {
    "id": "art-184",
    "number": "184",
    "title": "Article 184 Provision",
    "simplifiedText": "Article 184 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 184 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 184 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/fundamental_rights_illustration_1771044270654.png"
  },
  {
    "id": "art-185",
    "number": "185",
    "title": "Article 185 Provision",
    "simplifiedText": "Article 185 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 185 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 185 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/fundamental_rights_icon_1771045207570.png"
  },
  {
    "id": "art-186",
    "number": "186",
    "title": "Article 186 Provision",
    "simplifiedText": "Article 186 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 186 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 186 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_branch_hero_1771044850068.png"
  },
  {
    "id": "art-187",
    "number": "187",
    "title": "Article 187 Provision",
    "simplifiedText": "Article 187 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 187 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 187 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/parliament_illustration_1771044236750.png"
  },
  {
    "id": "art-188",
    "number": "188",
    "title": "Article 188 Provision",
    "simplifiedText": "Article 188 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 188 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 188 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_illustration_1771044551592.png"
  },
  {
    "id": "art-189",
    "number": "189",
    "title": "Article 189 Provision",
    "simplifiedText": "Article 189 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 189 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 189 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/preamble_illustration.png"
  },
  {
    "id": "art-190",
    "number": "190",
    "title": "Article 190 Provision",
    "simplifiedText": "Article 190 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 190 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 190 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_illustration.png"
  },
  {
    "id": "art-191",
    "number": "191",
    "title": "Article 191 Provision",
    "simplifiedText": "Article 191 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 191 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 191 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/high_court_illustration_1771044440164.png"
  },
  {
    "id": "art-192",
    "number": "192",
    "title": "Article 192 Provision",
    "simplifiedText": "Article 192 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 192 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 192 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_hero_1771044865419.png"
  },
  {
    "id": "art-193",
    "number": "193",
    "title": "Article 193 Provision",
    "simplifiedText": "Article 193 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 193 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 193 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_pillar_1771045189047.png"
  },
  {
    "id": "art-194",
    "number": "194",
    "title": "Article 194 Provision",
    "simplifiedText": "Article 194 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 194 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 194 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/supreme_court_india_1771044151085.png"
  },
  {
    "id": "art-195",
    "number": "195",
    "title": "Article 195 Provision",
    "simplifiedText": "Article 195 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 195 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 195 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/parliament_india_1771044134109.png"
  },
  {
    "id": "art-196",
    "number": "196",
    "title": "Article 196 Provision",
    "simplifiedText": "Article 196 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 196 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 196 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/governor_india_1771044165721.png"
  },
  {
    "id": "art-197",
    "number": "197",
    "title": "Article 197 Provision",
    "simplifiedText": "Article 197 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 197 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 197 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_illustration.png"
  },
  {
    "id": "art-198",
    "number": "198",
    "title": "Article 198 Provision",
    "simplifiedText": "Article 198 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 198 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 198 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_art_1771049294810.png"
  },
  {
    "id": "art-199",
    "number": "199",
    "title": "Article 199 Provision",
    "simplifiedText": "Article 199 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 199 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 199 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/supreme_court_illustration_1771044251244.png"
  },
  {
    "id": "art-200",
    "number": "200",
    "title": "Article 200 Provision",
    "simplifiedText": "Article 200 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 200 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 200 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/indian_parliament_illustration_1771044387970.png"
  },
  {
    "id": "art-201",
    "number": "201",
    "title": "Article 201 Provision",
    "simplifiedText": "Article 201 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 201 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 201 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_illustration.png"
  },
  {
    "id": "art-202",
    "number": "202",
    "title": "Article 202 Provision",
    "simplifiedText": "Article 202 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 202 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 202 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_branch_hero_1771044850068.png"
  },
  {
    "id": "art-203",
    "number": "203",
    "title": "Article 203 Provision",
    "simplifiedText": "Article 203 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 203 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 203 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/fundamental_rights_icon_1771045207570.png"
  },
  {
    "id": "art-204",
    "number": "204",
    "title": "Article 204 Provision",
    "simplifiedText": "Article 204 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 204 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 204 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/indian_parliament_illustration_1771044387970.png"
  },
  {
    "id": "art-205",
    "number": "205",
    "title": "Article 205 Provision",
    "simplifiedText": "Article 205 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 205 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 205 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/preamble_illustration.png"
  },
  {
    "id": "art-206",
    "number": "206",
    "title": "Article 206 Provision",
    "simplifiedText": "Article 206 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 206 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 206 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_branch_hero_1771044850068.png"
  },
  {
    "id": "art-207",
    "number": "207",
    "title": "Article 207 Provision",
    "simplifiedText": "Article 207 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 207 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 207 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/president_india_1771044119549.png"
  },
  {
    "id": "art-208",
    "number": "208",
    "title": "Article 208 Provision",
    "simplifiedText": "Article 208 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 208 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 208 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_illustration.png"
  },
  {
    "id": "art-209",
    "number": "209",
    "title": "Article 209 Provision",
    "simplifiedText": "Article 209 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 209 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 209 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/parliament_illustration_1771044236750.png"
  },
  {
    "id": "art-210",
    "number": "210",
    "title": "Article 210 Provision",
    "simplifiedText": "Article 210 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 210 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 210 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/preamble_illustration.png"
  },
  {
    "id": "art-211",
    "number": "211",
    "title": "Article 211 Provision",
    "simplifiedText": "Article 211 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 211 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 211 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_illustration.png"
  },
  {
    "id": "art-212",
    "number": "212",
    "title": "Article 212 Provision",
    "simplifiedText": "Article 212 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Legislature branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the legislature so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the legislature branch at the state level, Article 212 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Legislature",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 212 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_branch_hero_1771044865419.png"
  },
  {
    "id": "art-214",
    "number": "214",
    "title": "Article 214 Provision",
    "simplifiedText": "Article 214 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 214 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 214 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/law_and_justice_india_1771044199869.png"
  },
  {
    "id": "art-215",
    "number": "215",
    "title": "Article 215 Provision",
    "simplifiedText": "Article 215 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 215 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 215 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/equality_illustration_1771044348189.png"
  },
  {
    "id": "art-216",
    "number": "216",
    "title": "Article 216 Provision",
    "simplifiedText": "Article 216 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 216 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 216 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/high_court_illustration_1771044440164.png"
  },
  {
    "id": "art-217",
    "number": "217",
    "title": "Article 217 Provision",
    "simplifiedText": "Article 217 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 217 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 217 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/indian_parliament_illustration_1771044387970.png"
  },
  {
    "id": "art-218",
    "number": "218",
    "title": "Article 218 Provision",
    "simplifiedText": "Article 218 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 218 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 218 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/supreme_court_india_1771044151085.png"
  },
  {
    "id": "art-219",
    "number": "219",
    "title": "Article 219 Provision",
    "simplifiedText": "Article 219 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 219 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 219 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/indian_parliament_illustration_1771044387970.png"
  },
  {
    "id": "art-220",
    "number": "220",
    "title": "Article 220 Provision",
    "simplifiedText": "Article 220 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 220 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 220 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_illustration.png"
  },
  {
    "id": "art-221",
    "number": "221",
    "title": "Article 221 Provision",
    "simplifiedText": "Article 221 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 221 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 221 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/governor_india_1771044165721.png"
  },
  {
    "id": "art-222",
    "number": "222",
    "title": "Article 222 Provision",
    "simplifiedText": "Article 222 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 222 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 222 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_india_1771045228434.png"
  },
  {
    "id": "art-223",
    "number": "223",
    "title": "Article 223 Provision",
    "simplifiedText": "Article 223 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 223 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 223 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/indian_parliament_illustration_1771044387970.png"
  },
  {
    "id": "art-224",
    "number": "224",
    "title": "Article 224 Provision",
    "simplifiedText": "Article 224 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 224 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 224 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/preamble_illustration.png"
  },
  {
    "id": "art-225",
    "number": "225",
    "title": "Article 225 Provision",
    "simplifiedText": "Article 225 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 225 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 225 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_illustration_1771044551592.png"
  },
  {
    "id": "art-226",
    "number": "226",
    "title": "Article 226 Provision",
    "simplifiedText": "Article 226 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 226 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 226 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_pillar_1771045173548.png"
  },
  {
    "id": "art-227",
    "number": "227",
    "title": "Article 227 Provision",
    "simplifiedText": "Article 227 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 227 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 227 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/preamble_illustration_1771045972132.png"
  },
  {
    "id": "art-228",
    "number": "228",
    "title": "Article 228 Provision",
    "simplifiedText": "Article 228 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 228 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 228 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_branch_india_1771045228434.png"
  },
  {
    "id": "art-229",
    "number": "229",
    "title": "Article 229 Provision",
    "simplifiedText": "Article 229 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 229 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 229 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/supreme_court_india_1771044151085.png"
  },
  {
    "id": "art-230",
    "number": "230",
    "title": "Article 230 Provision",
    "simplifiedText": "Article 230 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 230 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 230 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/judiciary_illustration.png"
  },
  {
    "id": "art-231",
    "number": "231",
    "title": "Article 231 Provision",
    "simplifiedText": "Article 231 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 231 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 231 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/parliament_illustration_1771044236750.png"
  },
  {
    "id": "art-232",
    "number": "232",
    "title": "Article 232 Provision",
    "simplifiedText": "Article 232 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 232 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 232 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/president_illustration_1771044221817.png"
  },
  {
    "id": "art-233",
    "number": "233",
    "title": "Article 233 Provision",
    "simplifiedText": "Article 233 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 233 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 233 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/indian_parliament_illustration_1771044387970.png"
  },
  {
    "id": "art-234",
    "number": "234",
    "title": "Article 234 Provision",
    "simplifiedText": "Article 234 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 234 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 234 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/legislature_illustration_1771044551592.png"
  },
  {
    "id": "art-235",
    "number": "235",
    "title": "Article 235 Provision",
    "simplifiedText": "Article 235 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 235 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 235 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/executive_illustration.png"
  },
  {
    "id": "art-236",
    "number": "236",
    "title": "Article 236 Provision",
    "simplifiedText": "Article 236 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 236 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 236 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/president_india_1771044119549.png"
  },
  {
    "id": "art-237",
    "number": "237",
    "title": "Article 237 Provision",
    "simplifiedText": "Article 237 is an important constitutional provision under Part VI of the Indian Constitution. It deals with matters related to the Judiciary branch at the State level of government. This article helps define powers, responsibilities, structure, and functioning of the judiciary so that governance remains structured, accountable, and constitutionally valid. It ensures that the balance of power and rule of law are maintained within the Indian democratic framework.",
    "example": "For example, if an issue arises concerning the functioning, powers, appointment, removal, or responsibilities of authorities under the judiciary branch at the state level, Article 237 provides the constitutional guidance. Courts, government officials, and lawmakers may refer to this article when interpreting constitutional procedures or resolving disputes.",
    "originalPart": "VI",
    "category": "Judiciary",
    "organ": "State",
    "difficulty": "Medium",
    "funFact": "Fun Fact: Article 237 contributes to the foundational structure of India's constitutional democracy. Many such provisions were inspired by constitutional systems like the UK, USA, Ireland, and Canada, but adapted to suit India's federal and parliamentary system.",
    "imageUrl": "/assets/articles/preamble_illustration.png"
  }
]